#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.main: Refreshing state... [id=vpc-01c74b98a6d260f3d]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-02787ed54c853ceea]
aws_security_group.security_group: Refreshing state... [id=sg-00080908f6a4d4c50]
aws_subnet.subnet1: Refreshing state... [id=subnet-0aaa9511a64803743]
aws_subnet.subnet2: Refreshing state... [id=subnet-0a791d9cb0090bcde]
aws_lb_target_group.ecs_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:668551228068:targetgroup/ecs-target-group/52256d45ca7a58b5]
aws_route_table.route_table: Refreshing state... [id=rtb-02528595d8bf1d3bc]
aws_launch_template.ecs_lt: Refreshing state... [id=lt-0348c2a0e2c3f92c1]
aws_route_table_association.subnet2_route: Refreshing state... [id=rtbassoc-0a1d894bc474c418b]
aws_route_table_association.subnet1_route: Refreshing state... [id=rtbassoc-099f03d9eb0bca898]
aws_alb.ecs_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:668551228068:loadbalancer/app/ecs-alb/ae2a46a3b24d6c94]
aws_autoscaling_group.ecs_asg: Refreshing state... [id=terraform-20240819135012409500000001]
aws_alb_listener.ecs_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:668551228068:listener/app/ecs-alb/ae2a46a3b24d6c94/decec3b9d08b7af5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_capacity_provider.ecs_capacity_provider will be created
  + resource "aws_ecs_capacity_provider" "ecs_capacity_provider" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ecs_capacity_provider"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = "arn:aws:autoscaling:us-east-1:668551228068:autoScalingGroup:a1b4600a-ee9b-4c3d-b08d-f98dc0de0ea5:autoScalingGroupName/terraform-20240819135012409500000001"
          + managed_draining               = (known after apply)
          + managed_termination_protection = (known after apply)

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 1000
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 1
            }
        }
    }

  # aws_ecs_cluster.ecs_cluster will be created
  + resource "aws_ecs_cluster" "ecs_cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "my-ecs-cluster"
      + tags_all = (known after apply)

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_cluster_capacity_providers.ecs_cluster_capacity_providers will be created
  + resource "aws_ecs_cluster_capacity_providers" "ecs_cluster_capacity_providers" {
      + capacity_providers = [
          + "ecs_capacity_provider",
        ]
      + cluster_name       = "my-ecs-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "ecs_capacity_provider"
          + weight            = 100
        }
    }

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "my-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + capacity_provider = "ecs_capacity_provider"
          + weight            = 100
        }

      + load_balancer {
          + container_name   = "dockergs"
          + container_port   = 3000
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:668551228068:targetgroup/ecs-target-group/52256d45ca7a58b5"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-00080908f6a4d4c50",
            ]
          + subnets          = [
              + "subnet-0a791d9cb0090bcde",
              + "subnet-0aaa9511a64803743",
            ]
        }

      + placement_constraints {
          + type = "distinctInstance"
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                   = (known after apply)
      + arn_without_revision  = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + cpu                   = 256
                  + essential             = true
                  + image                 = "docker.io/omkarsathe01/projects:main"
                  + memory                = 512
                  + name                  = "dockergs"
                  + portMappings          = [
                      + {
                          + containerPort = 3000
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                  + repositoryCredentials = {
                      + credentialsParameter = "arn:aws:secretsmanager:us-east-1:668551228068:secret:DockerSecret-uvrqnZ"
                    }
                },
            ]
        )
      + cpu                   = "256"
      + execution_role_arn    = "arn:aws:iam::668551228068:role/ecsTaskExecutionRole"
      + family                = "my-ecs-task"
      + id                    = (known after apply)
      + network_mode          = "awsvpc"
      + revision              = (known after apply)
      + skip_destroy          = false
      + tags_all              = (known after apply)
      + track_latest          = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
**Pushed by: @omkarsathe01, Action: pull_request**